import { Card, Saved } from "./db.service";

export const mock_card_types: Saved<Card>[] = [
    {
        id: '0',
        el: {
            name: 'Пингвин',
            types: ['normal'],
            imageUrl: '/assets/images/cards/pingvin.jpg',
            info: [
                {
                    content: 'Тъй като нямат естествен враг на сушата, пингвините не показват страх, а любопитство когато към тях се приближи човек.',
                    heading: 'Интересно'
                }
            ]
        }
    },
    {
        id: '1',
        el: {
            name: 'Пингвин',
            types: ['normal'],
            imageUrl: '/assets/images/cards/pingvin2.jpg',
            info: [
                {
                    content: 'Пингвините мътят яйцата си на смени. Когато мъжкият отиде да яде, той не може да намери пътя обратно към гнездото и започва да крещи шумно. Женските разпознават гласовете на партньорите си сред хиляди други и крещят в отговор, така че те да знаят къде да се върнат.',
                    heading: 'Интересно'
                }
            ]
        }
    },
    {
        id: '2',
        el: {
            name: 'Делфин',
            types: ['normal'],
            imageUrl: '/assets/images/cards/delfin.jpg',
            info: [
                {
                    content: 'Делфините общуват по между си с помощта на звуци, като всеки звук може да изразява различно настроение.',
                    heading: 'Интересно'
                }
            ]
        }
    },
    {
        id: '3',
        el: {
            name: 'Делфин',
            types: ['normal'],
            imageUrl: '/assets/images/cards/delfin2.jpg',
            info: [
                {
                    content: 'Делфините никога не заспиват напълно. Докато си почиват, едната половина на мозъка им продължава да бъде активна. Ето защо дори и по време на сън едното им око остава отворено.',
                    heading: 'Интересно'
                }
            ]
        },
    },
    {
        id: '4',
        el: {
            name: 'Син кит',
            types: ['normal'],
            imageUrl: '/assets/images/cards/sinkit.jpg',
            info: [
                {
                    content: 'Освен най-едрото, синият кит е и най-шумното животно – звукът, който издава е от порядъка на 188 децибела и може да бъде чут на разстояние до 800 км. За сравнение, звукът на пътнически самолет е „едва” 120 децибела.',
                    heading: 'Интересно'
                }
            ]
        }
    },
    {
        id: '5',
        el: {
            name: 'Син кит',
            types: ['normal'],
            imageUrl: '/assets/images/cards/sinkit2.jpg',
            info: [
                {
                    content: 'Езикът на кита тежи около 4,7 тона',
                    heading: 'Интересно'
                }
            ]
        }
    },
    {
        id: '6',
        el: {
            name: 'Пор',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/por.jpg',
            info: [
                {
                    heading: 'Морфология на "пор"',
                    content: 'Думата "пор" произлиза от латински и означава "крадец".',
                },
                {
                    heading: 'Застрашен вид',
                    content: 'Загубата на местообитания и бракониерството, са причина днес те или техните следи да се наблюдават изключително рядко.',
                },
            ],
        },
    },
    {
        id: '7',
        el: {
            name: 'Кафява мечка',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/kafqva-mechka.jpg',
            info: [
                {
                    heading: 'Сладки сънища',
                    content: 'Учените вярват, че мечките могат да сънуват.',
                },
                {
                    heading: 'Fast as f',
                    content: 'Макар да изглеждат тромави,мечките могат да тичат с до 60 км/ч.',
                },
                {
                    heading: 'Застрашен вид',
                    content: 'За съжаление хората им нанасят непоправими щети, като разкъсват с пътища и огради ареала им, унищожават горите и ги избиват.',
                },
            ],
        },
    },
    {
        id: '8',
        el: {
            name: 'Балканска дива коза',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/koza.jpg',
            info: [
                {
                    heading: 'Властелина на пръстените',
                    content: 'Знаехте ли, че всяка година се прибавя по още един пръстен върху рогата на дивата коза, като така може да се определи възрастта на даденото животно.',
                },
                {
                    heading: 'И ся почваме да бегами',
                    content: 'На света няма друго животно, което да притежава по-голяма ловкост и бързина на придвижване по хлъзгави и стръмни терени.',
                },
            ],
        },
    },
    {
        id: '9',
        el: {
            name: 'Прилеп',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/prilep.jpg',
            info: [
                {
                    heading: 'Напаст пещерна',
                    content: 'най-голямата колония от прилепи в света наброява над 20 милиона броя от тези летящи създания.',
                },
                {
                    heading: 'Ехо .... (ехо)',
                    content: 'Прилепите използват ехолокация, за да се заобиколят в тъмното.',
                },
                {
                    heading: 'Защитен вид',
                    content: 'Според българското законодателство, прилепите са защитени видове.',
                },
            ],
        },
    },
    {
        id: '10',
        el: {
            name: 'Лалугер',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/laluger.jpg',
            info: [
                {
                    heading: 'Втори братовчед на ленивеца',
                    content: 'Когато е студено, той заспива зимен сън и се събужда едва през пролетта.',
                },
                {
                    heading: 'Мали ша са напикая',
                    content: 'Когато е изплашен, той застава на задните си лапи.',
                },
                {
                    heading: 'Защитен вид',
                    content: 'Интензивно селско стопанство и използване на пестициди причиняват бързото изчезване на този вид.',
                },
            ],
        },
    },
    {
        id: '11',
        el: {
            name: 'Етруската земеровка',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/zemerovka.jpg',
            info: [
                {
                    heading: 'Размер',
                    content: 'Един от най-дребните бозайници на планетата с размери едва 3,6 до 5,2 см и тегло от 1,25 до 2,34 грама!',
                },
                {
                    heading: 'Лакомници',
                    content: 'Етруската земеровка трява да яде непрекъснато за да може да живее.',
                },
            ],
        },
    },
    {
        id: '12',
        el: {
            name: 'Тюленът монах',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/tuleni.jpg',
            info: [
                {
                    heading: 'Техния живот',
                    content: 'Те се крият в подводни пещери, където си почиват и раждат своите малки.',
                },
            ],
        },
    },
    {
        id: '13',
        el: {
            name: 'Видра',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/vidra.jpg',
            info: [
                {
                    heading: 'Мали колко сладко',
                    content: 'Морските видри се държат за ръце  докато спят, за да не бъдат разделени от теченията докато се носят по водната повърхност.',
                },
                {
                    heading: 'NO MERCY',
                    content: 'В момент на опасност видрите показват бебетата си на хищниците, за да предизвикат съчувствие и по този начин да избегнат атаката.',
                },
            ],
        },
    },
    {
        id: '14',
        el: {
            name: 'Ловен сокол',
            types: ['endangered'],
            imageUrl: '/assets/images/cards/sokol.jpg',
            info: [
                {
                    heading: 'Ловни навици',
                    content: 'Те не ловуват близо до гнездата си, а се опитват да летят доколкото е възможно.',
                },
                {
                    heading: 'Застрашен вид',
                    content: 'Има опасност от изчезване. Основната причина, поради която населението на ловния сокол намалява, е човешката дейност.',
                },
            ],
        },
    },
    {
        id: "15",
        el: {
            name: "Иглика",
            imageUrl: "/assets/images/cards/image_1.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Доказано е, че в разгара на зимата депресиите силно подтискат хората, намаляват обичайната им жизненост и работоспособност, а при психически по-неустойчивите се развиват болестни симптоми. И без евтина реклама – доказано е също, че едно малко, но изумително красиво растение – разцъфнала иглика, прави понякога повече за настроението в мрачните студени дни, отколкото скъпоструващи медикаменти и психотерапии. Дори и без депресия, саксийката с иглика ще ви донесе истинска радост."
                }
            ]
        }
    },
    {
        id: "16",
        el: {
            name: "Карамфил",
            imageUrl: "/assets/images/cards/image_2.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Карамфилът е известен като подправка с изтънчен вкус от незапомнени времена. Карамфилът е родом от Молукас, известен като Островите на подправките в Индия. Той е консумиран в Азия от преди повече от 2000 години. Благодарение на сладкия си и ароматен вкус, китайските царедворци са използвали карамфила, за да освежават дъха си, когато е трябвало да се обръщат към императора."
                }
            ]
        }
    },
    {
        id: "17",
        el: {
            name: "Лале",
            imageUrl: "/assets/images/cards/image_3.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "В общия случай се приема, че лалетата символизират любовта и пристигането на пролетта. Червените лалета са израз на истинска любов, докато с белите можете да поискате прошка, лилавите пък са знак за царственост. Интересното е, че многоцветният букет се смята за комплимент към очите на получателя."
                }
            ]
        }
    },
    {
        id: "18",
        el: {
            name: "Нарцис",
            imageUrl: "/assets/images/cards/image_4.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "На всички ни е известен терминът от психологията \"нарцисизъм\" - с него се определят самовлюбените и горди хора."
                }
            ]
        }
    },
    {
        id: "19",
        el: {
            name: "Божур",
            imageUrl: "/assets/images/cards/image_5.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Ароматното растение е символ на успех и просперитет, привлича богатството и помага в професионалното израстване."
                }
            ]
        }
    },
    {
        id: "20",
        el: {
            name: "Маслодайна роза",
            imageUrl: "/assets/images/cards/image_6.jpg",
            types: [
                "endangered"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Розовото масло преди всичко е благоуханно удоволствие за сетивата.  Наричано „течно злато“, заради уникалните му свойства и високата цена, розовото масло е природен еликсир с неизброими ползи. "
                }
            ]
        }
    },
    {
        id: "21",
        el: {
            name: "Жасмин",
            imageUrl: "/assets/images/cards/image_7.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Жасминовите цветя са важни в хиндуистки церемонии и са споменати в религиозни текстове. И мъжете и жените в Индия отдавна използват жасминовото масло като афродизиак, като тоник във фризьорството и козметиката, както и не на последно място в парфюмерията."
                }
            ]
        }
    },
    {
        id: "22",
        el: {
            name: "Еделвайс",
            imageUrl: "/assets/images/cards/image_8.jpg",
            types: [
                "endangered"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: " Пчелите го обичат заради медоносните цветове, макар че го намират рядко. Поради безразборното бране има опасност еделвайсът да изчезне от нашите планини, затова късането му е забранено със закон и растението е включено в \"Червената книга на България\". Цветовете на еделвайса се използват в медицината за приготвяне на лекарства против болести на белите дробове, сърцето и др. B Стара Планина специално за опазването му е създаден резерват \"Козя стена\"."
                }
            ]
        }
    },
    {
        id: "23",
        el: {
            name: "Бегония",
            imageUrl: "/assets/images/cards/image_9.jpg",
            types: [
                "normal"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Според вярванията бегонията е голям помощник на здравето.Тя не само възстановява здравето на възрастните хора, а и предпазва това на по-младите.Бегонията е знак за удължаване на живота на човека, който я е получил като подарък."
                }
            ]
        }
    },
    {
        id: "24",
        el: {
            name: "Орхидея",
            imageUrl: "/assets/images/cards/image_10.jpg",
            types: [
                "endangered"
            ],
            info: [
                {
                    heading: "Интересно",
                    content: "Феята на цветята. Символичен заряд носят и различните цветове: бели орхидеи за невинност, чистота и елегантност; розови - за женственост, благодат и радост; жълти – за приятелство и ново начало; пурпурни – за възхищение и в знак на уважение към близък човек."
                }
            ]
        }
    },
    {
        id: '25',
        el: {
            name: 'Гепард',
            imageUrl: '/assets/images/cards/gepard.jpg',
            types: [ 'normal' ],
            info: [
                {
                    heading: 'Тишината е злато',
                    content: 'Интересното е, че гепардът не може да реве. Всъщност те мъркат.'
                },
                {
                    heading: 'Бърз като вятъра',
                    content: 'Нормалната скорост на преследване за гепард е 80кмч.'
                },
            ],
        },
    },
    {
        id: '26',
        el: {
            name: 'Лъв',
            imageUrl: '/assets/images/cards/luv.jpg',
            types: [ 'normal' ],
            info: [
                {
                    heading: 'Гръмогласни',
                    content: 'Ревът на възрастен лъв може да се чуе на разстояние от 8 километра.'
                },
            ],
        },
    },
    {
        id: '27',
        el: {
            name: 'Тигър',
            imageUrl: '/assets/images/cards/tigar.jpg',
            types: [ 'endangered' ],
            info: [
                {
                    heading: 'Интересно',
                    content: 'Няма два тигъра с еднакви ивици.'
                },
                {
                    heading: 'Скок на височина',
                    content: 'Тигрите могат да прескачат разстояния на дължина над 6м и да скачат на 5м височина вертикално.'
                },
            ],
        },
    },
    {
        id: '28',
        el: {
            name: 'Панда',
            imageUrl: '/assets/images/cards/panda.jpg',
            types: [ 'endangered' ],
            info: [
                {
                    heading: 'Лакомници',
                    content: 'Пандите могат да надебелеят с 28 килограма на ден, хранейки се само с бамбукови клони.'
                },
                {
                    heading: 'Застрашени',
                    content: 'За съжаление тези красиви мечки са застрашени и се смята, че само около 1000 остават в дивата природа.'
                },
            ],
        },
    },
    {
        id: "29",
        el: {
            name: "Блатно кокиче",
            types: ['endangered'],
            imageUrl: "/assets/images/cards/image_11.jpg",
            info: [
                {
                    heading: "Интересно",
                    content: "Най-лечебната билка, която е успяла да спаси не един и два детски живота, всъщност е билката блатно кокиче.Лечебните свойства на растението са доказани през годините. От него се прави и лекарството „Нивалин”.",
                },
            ],
        },
    },
    {
        id: "30",
        el: {
            name: "Родопско лале",
            types: ['endangered'],
            imageUrl: "/assets/images/cards/image_12.jpg",
            info: [
                {
                    heading: "Интересно",
                    content: "Цветовете на родопското лале се разтварят само когато слънцето залее със светлина и топлина местата, където то расте. Покрият ли тежки облаци небето и от тях рукне дъжд, цветовете бързо се затварят и по този начин се предпазват от прекомерно изстудяване и от наранявания от силен дъжд и вятър. Това явление се наблюдава и всяка вечер, щом падне нощният мрак. ",
                },
            ],
        },
    },
    {
        id: "31",
        el: {
            name: "Алпийско сграбиче",
            types: ['endangered'],
            imageUrl: "/assets/images/cards/image_13.jpg",
            info: [
                {
                    heading: "Интересно",
                    content: "В Червена книга на Народна Република България - том 1, видът е категоризиран като \"рядък\". В същият източник като заплахи за вида са посочени: \"деградацията на хабитата, в който той се среща, причинена от залесяване, туризъм и процесите на естествено разширяване на гората\".",
                },
            ],
        },
    },
    {
        id: "32",
        el: {
            name: "Жълт планински крем",
            types: ['endangered'],
            imageUrl: "/assets/images/cards/image_14.jpg",
            info: [
                {
                    heading: "Интересно",
                    content: "Планинският крем е защитен вид и е включен в Червената книга на България, Не опитвайте да го късате, тъй като стъблото е много жилаво и се изтръгва до самата луковица, което го обрича на загиване.",
                },
            ],
        },
    },
    {
        id: "33",
        el: {
            name: "Дива циклама",
            types: ['endangered'],
            imageUrl: "/assets/images/cards/image_15.jpg",
            info: [
                {
                    heading: "Интересно",
                    content: "Защитен вид и рядко се среща. Лекува бронхит, упорита кашлица и възпалено гърло.",
                },
            ],
        },
    },
];
